{
    "https://www.express.co.uk/news/us/1887722/joe-biden-lie-blunder-college-wisconsin-speech": {
        "id": 8,
        "title": "Joe Biden caught 'lying' as he repeats untrue story in latest embarrassing blunder",
        "platform": "express",
        "article_text": " is facing scrutiny after allegedly misrepresenting his family's educational background during a recent campaign speech in  , reigniting a controversy that tarnished a previous bid for the   in 1988. During his speech, Biden, 81, claimed to be the first in his family to attend college, a statement that contradicts previous assertions and historical records. The president's appearance in Wisconsin, a pivotal swing state, aimed to address his administration's policies, particularly his initiatives on student loan forgiveness. However, his remarks veered into his personal history, when he said: \"I, like an awful lot of people in this audience, was the first in my family to go to college and watch my dad struggle to help me get there.\" This statement echoes a similar claim made during his ill-fated 1988 presidential campaign, which ended abruptly amid allegations of plagiarism. At the time, Biden suspended his campaign following accusations of lifting passages from a speech by former   leader Neil Kinnock without attribution. Kinnock's speech, which emphasized his family's struggle to access higher education, served as a template for Biden's remarks. Biden's speech at the time echoed Kinnock's words. At the time, Biden said: \"Why is it that   is the first in his family ever to go to a university? [...] Is it because I'm the first Biden in a thousand generations to get a college and a graduate degree that I was smarter than the rest?\" This was remarkably similar to what Kinnock said: “Why am I the first Kinnock in a thousand generations to be able to get to university?\" The politicians also both mentioned thier wives being the first in their family to attend higher education. The controversy surrounding   has reignited debate over his credibility and transparency, particularly as he seeks re-election. Social media users, including conservative influencers, have seized upon the discrepancy, highlighting previous instances where Biden contradicted himself on the same issue. Conservative influencer Greg Price pointed out: \"  just said in a speech in Wisconsin 'I, like an awful lot of people in this audience, was the first in my family to go to college.' \"That is a lie. One of the reasons we know it's a lie is because Biden has bragged several times in the past about how his grandfather played college football.” Price also shared a post from the RNC Research account on   showing that The New York Times caught Biden making the same two contrary claims in 1987. The article reads: \"Mr Biden had said he was the 'first in his family ever to go to university.' In fact, Mr Biden said today, 'there are Finnegans, my mother’s family, that went to college.'\" We use your sign-up to provide content in ways you've consented to and to improve our understanding of you. This may include adverts from us and 3rd parties based on our understanding. You can unsubscribe at any time. Read our  Get all the latest news, entertainment, sport and lifestyle updates from our dedicated American team. Follow on  and Twitter",
        "scaled_num_entities": 0.0,
        "scaled_num_quotes": 0.2765957446808511,
        "scaled_sentiment_polarity": 0.10313957581045066,
        "scaled_sentiment_subjectivity": 0.0,
        "scaled_num_speculations": 0.0,
        "scaled_article_length": 0.0,
        "scaled_avg_sentence_length": 0.22132633945297872,
        "scaled_num_adjectives": 0.0,
        "scaled_num_numerical_data": 0.06369426751592357,
        "scaled_readability": 0.2326343381389255,
        "scaled_headline_relevance": 0.0,
        "topic_score": 0.0
    }
}