{
    "https://www.usatoday.com/story/money/2024/06/16/spaving-meaning-discounts-can-derail-finances/74095929007/": {
        "id": 8,
        "title": "Buy two, get one half off? How 'spaving' discounts can derail your finances",
        "platform": "usatoday",
        "article_text": "Any time you buy two of something and get a third item for half off, or add a few dollars to an online order to secure free shipping, you are “spaving.”  is a mashup of “spending” and “saving”: spending more to trigger savings. But don’t fool yourself, experts say: Spaving is mostly spending. “It’s always more spending. It’s not always more saving,” said , an associate professor of marketing at the Tepper School of Business at Carnegie Mellon University in Pittsburgh. Spaving has been  lately. It sounds like something new: The term has seldom appeared in this publication. It isn’t in the online Merriam-Webster . Type it into your word processor and watch your spellchecker erupt in protest.   The concept behind spaving, however, goes wa-a-ay back. “Spaving, besides being a terrible word, is not a new idea,” Galak said. “These promotions have been around forever.” Here’s the basic concept: A merchant entices a customer to spend a little more, or a lot more, by offering a discount as a reward. Buy a third item, or a fourth, or a fifth, and get the last one free. Add another ten dollars to your cart, and that $5 shipping fee goes away. Who needs a gallon of extra-virgin olive oil? Maybe you do, at the right price. Customers may be seeing a lot of spaving offers this summer. Inflation has been pushing up prices. A dozen eggs cost  what they did in 2019. Overall, consumer prices rose by  between 2019 and 2023, federal data show. Consumers are pushing back. In response, retailers are rolling out deals. Fast food chains are  in the wake of consumer backlash against reports of  .  and  have announced summer price cuts. More customers are choosing discounted . Spending less for the same Happy Meal you bought a week ago is a no-brainer. Spaving, by contrast, can quickly spiral out of control. The problem with spaving, experts say, is that it can lead a shopper to overspend on something they did not want, do not need and will not use. “It’s always good to save money. The problem is when you’re spending money you wouldn’t have spent otherwise,” said , a personal finance expert at NerdWallet. Palmer herself recently succumbed to a spaving offer. “It was a buy one, get one free,” she said. “I never intended to get a second shirt. It was for my daughter. I went ahead and bought two.” The second shirt was free, so Palmer got a great deal, right? Well, maybe not. She paid full price for the first shirt. Absent the spaving deal, she would have held out for a discount. In the end, she said, “I did spend more than I wanted to.” There is really only one kind of spaving offer that guarantees a good deal, experts say: One that has you spending less money in the end. “Say you’re going to check out, and your cart is $5 short of the minimum to save you $30 on shipping,” said , an analyst at WalletHub. “Then, maybe spending the $5 to get the free shipping is a good idea.” Most of the time, though, spaving makes you spend more: That’s the point, at least from the retailer’s perspective. And if you are spending more, are you still getting a better deal? It depends. Before you commit to buying more of something to trigger a discount, experts say, ask yourself these questions: Stocking up on laundry pods, or frozen steaks, or paper napkins at volume-discount prices might make all the sense in the world. “My husband and I both work from home,” Happe said. “So, necessities like toilet paper, stuff like that, we buy that in bulk now, because we know we’re going to go through it.” Be careful, though, if you see a spaving offer on ears of corn, or bananas, or nonfrozen steaks. Or anything with a short shelf life. Or anything your family might tire of consuming. Or anything you wouldn’t buy anyway. The appeal of spaving is obvious: Consumers like to think they are saving money. “You get that temporary emotional high because you feel like you locked in a good deal,” said , a partner at Crewe Advisors in Scottsdale, Arizona. The problem comes, Yamano said, when consumers want to save money so badly that they end up spending more of it, and on things they won't use. “You walk into Target, and you’re just there to buy dish soap,” she said. “But then there’s a deal in the next aisle, and you’re walking out with a cart full of stuff you don’t need.” The arithmetic behind spaving can be tricky. Let’s say you buy three pairs of shoes, with the third offered at 50% off. A quick calculation reveals that you’re not really saving 50%. You’re only saving that much on one item. If each pair costs $50, you save $25 on the entire purchase, lowering the tab from $150 to $125: a savings of about 17%. And what if the third pair costs only $30? In the typical spaving deal, the retailer takes the discount on the cheapest item. Now, you’re saving only $15, lowering the price from $130 to $115. Your savings drops below 12%. A consumer can figure this out with an iPhone calculator. But few of us have time to do the math. “A lot of times, with spaving, it’s a high-pressure situation,” Palmer said. “It’s going to expire in the next few hours, at the end of the day, so there’s some urgency to it.” Here are a few more expert tips on how to shop – and “spave” – without overspending: \"I will give myself 24 to 48 hours before purchasing something,\" said  , head of money wellness at Ally Financial. After that pause, she said, \"if it's still on my brain, then it's OK.\"",
        "scaled_num_entities": 0.0546218487394958,
        "scaled_num_quotes": 0.851063829787234,
        "scaled_sentiment_polarity": 0.963144228634765,
        "scaled_sentiment_subjectivity": 0.21597025010150786,
        "scaled_num_speculations": 1.0,
        "scaled_article_length": 0.21049942521394815,
        "scaled_avg_sentence_length": 0.0,
        "scaled_num_adjectives": 0.3402061855670103,
        "scaled_num_numerical_data": 0.21019108280254778,
        "scaled_readability": 1.0,
        "scaled_headline_relevance": 0.0,
        "topic_score": 0.3333333333333333
    },
    "https://www.usatoday.com/story/tech/2024/06/10/apple-ios-18/74045850007/": {
        "id": 8,
        "title": "iOS 18 unveiled: See key new features and changes coming with next iPhone operating system",
        "platform": "usatoday",
        "article_text": "Apple announced new features coming to iPhones via iOS 18 and the company's AI-powered intelligence system called \"Apple Intelligence\" at the   (WWDC) on Monday, including scheduled iMessages, interface customizability and one-of-a-kind emojis. With iOS 18 and Apple Intelligence coming later this year, according to Apple executive Craig Federighi, iPhone users will have access to a smarter, more customizable and more powerful mobile operating system. \"We are just getting started, I hope you are as excited as I am about the road ahead,\" Federighi said during Apple's keynote at WWDC. Here are some of the new features coming via iOS 18 and Apple Intelligence.  will debut this fall as a free download for iPhone Xs and later. When iPhone users unlock their devices, they are typically met by a wallpaper and a ton of apps. With iOS 18, users will be able to further customize their home screen in various ways, including by: The control center is also more customizable as iPhone users will be able to group their favorite controls, including ones created by third-party apps. The flashlight and camera shortcuts on the lock screen will also be changeable. The Messages app will have a lot of new features coming thanks to iOS 18 and Apple Intelligence, Apple leaders announced Monday. Scheduled messages, emoji tapbacks and text effects were announced as improvements to the Message app. The text effects will allow users to visually amplify their messages, while emoji tapbacks are ways to respond to text messages more expressively. Rich Communication Services (RCS) is another new edition to Messages coming via iOS 18 and the improvement will allow for smoother text messaging between iPhone and Android users. With the help of Apple Intelligence, users will be able to create custom \"Genmoji\" to match any moment. All users will have to do is provide a description and a Genmoji will appear, along with other options to choose from. Genmojis can also be added inline in messages. Another feature available in Messages courtesy of Apple Intelligence is users' ability to create \"total original images\" of people in sketch and animated forms. Apple used a contact's birthday as an example, and a custom sketch was created and sent via the Messages app. Photos is receiving its \"biggest redesign ever\" as the app will now be \"unified to a single view.\" Filter options are coming to the app and users will able to search through photos by the month or year they were taken. Screenshots can also be filtered out. A collections feature is now included and will allow users to browse through customizable sections. A carousel that updates daily is another feature that allows users to see their favorite photos in a new format. The Mail app will be able to separate emails into sections to make users' inboxes more organized. Incoming email is separated into: A new mail digest feature will also make skimming important emails easier. Safari will be able to make it easier to get the gist of articles or webpages quickly by finding key information and summarizing. For example, Safari will summarize a long article for users or find the location of a restaurant just by its name appearing on a webpage. The Passwords app will make it easier for users to store and access their passwords, passkeys, Wi-Fi passwords, and verification codes. The app will also tell users if their passwords are weak or have been used multiple times. The iOS 18 update will also help users' privacy by allowing them to hide apps and lock apps to where it would require a passcode or Face ID to open them. Due to Apple Intelligence, Siri will be more advanced than ever by being able to:",
        "scaled_num_entities": 0.008403361344537815,
        "scaled_num_quotes": 0.1702127659574468,
        "scaled_sentiment_polarity": 1.0,
        "scaled_sentiment_subjectivity": 0.6405850622097823,
        "scaled_num_speculations": 0.0,
        "scaled_article_length": 0.0,
        "scaled_avg_sentence_length": 0.526515795164903,
        "scaled_num_adjectives": 0.0,
        "scaled_num_numerical_data": 0.012738853503184714,
        "scaled_readability": 0.3143418467583498,
        "scaled_headline_relevance": 0.0,
        "topic_score": 0.0
    }
}