{
    "https://www.express.co.uk/news/us/1887722/joe-biden-lie-blunder-college-wisconsin-speech": {
        "id": 8,
        "title": "Joe Biden caught 'lying' as he repeats untrue story in latest embarrassing blunder",
        "platform": "express",
        "article_text": " is facing scrutiny after allegedly misrepresenting his family's educational background during a recent campaign speech in  , reigniting a controversy that tarnished a previous bid for the   in 1988. During his speech, Biden, 81, claimed to be the first in his family to attend college, a statement that contradicts previous assertions and historical records. The president's appearance in Wisconsin, a pivotal swing state, aimed to address his administration's policies, particularly his initiatives on student loan forgiveness. However, his remarks veered into his personal history, when he said: \"I, like an awful lot of people in this audience, was the first in my family to go to college and watch my dad struggle to help me get there.\" This statement echoes a similar claim made during his ill-fated 1988 presidential campaign, which ended abruptly amid allegations of plagiarism. At the time, Biden suspended his campaign following accusations of lifting passages from a speech by former   leader Neil Kinnock without attribution. Kinnock's speech, which emphasized his family's struggle to access higher education, served as a template for Biden's remarks. Biden's speech at the time echoed Kinnock's words. At the time, Biden said: \"Why is it that   is the first in his family ever to go to a university? [...] Is it because I'm the first Biden in a thousand generations to get a college and a graduate degree that I was smarter than the rest?\" This was remarkably similar to what Kinnock said: “Why am I the first Kinnock in a thousand generations to be able to get to university?\" The politicians also both mentioned thier wives being the first in their family to attend higher education. The controversy surrounding   has reignited debate over his credibility and transparency, particularly as he seeks re-election. Social media users, including conservative influencers, have seized upon the discrepancy, highlighting previous instances where Biden contradicted himself on the same issue. Conservative influencer Greg Price pointed out: \"  just said in a speech in Wisconsin 'I, like an awful lot of people in this audience, was the first in my family to go to college.' \"That is a lie. One of the reasons we know it's a lie is because Biden has bragged several times in the past about how his grandfather played college football.” Price also shared a post from the RNC Research account on   showing that The New York Times caught Biden making the same two contrary claims in 1987. The article reads: \"Mr Biden had said he was the 'first in his family ever to go to university.' In fact, Mr Biden said today, 'there are Finnegans, my mother’s family, that went to college.'\" We use your sign-up to provide content in ways you've consented to and to improve our understanding of you. This may include adverts from us and 3rd parties based on our understanding. You can unsubscribe at any time. Read our  Get all the latest news, entertainment, sport and lifestyle updates from our dedicated American team. Follow on  and Twitter",
        "scaled_num_entities": 0.0,
        "scaled_num_quotes": 0.2765957446808511,
        "scaled_sentiment_polarity": 0.10313957581045066,
        "scaled_sentiment_subjectivity": 0.0,
        "scaled_num_speculations": 0.0,
        "scaled_article_length": 0.0,
        "scaled_avg_sentence_length": 0.22132633945297872,
        "scaled_num_adjectives": 0.0,
        "scaled_num_numerical_data": 0.06369426751592357,
        "scaled_readability": 0.2326343381389255,
        "scaled_headline_relevance": 0.0,
        "topic_score": 0.0
    },
    "https://www.foxnews.com/politics/trump-meets-everyday-americans-chick-fil-a-biden-fine-dines-clintons-billionaires-dc": {
        "id": 5,
        "title": "Trump meets everyday Americans at Chick-fil-A while Biden fine dines with Clintons, billionaires in DC",
        "platform": "foxnews",
        "aticle_text": "fox news contributor karl rove joins 'america's newsroom' to discuss former president trump's image after his recent visit to chick-fil-a, the effectiveness of bidenomics and kamala harris' claim this could be the last democratic election. while former was out on the campaign trail meeting with everyday americans at a chick-fil-a restaurant in georgia on wednesday, president biden was fine dining with the clintons and other prestigious guests at the white house. in atlanta, trump met with locals and had unscripted conversations, bought them "the lord’s chicken" and urged them to support his third bid for the presidency. more than 500 miles away, in biden hosted japanese prime minister fumio kishida at a white house state dinner. some notable attendees of the dinner included: bill and hillary clinton, amazon’s jeff bezos and his fiancee lauren sanchez, apple ceo tim cook, jpmorgan chase ceo jamie dimon, blackrock ceo laurence fink, actor robert deniro and his girlfriend tiffany chen, former president of planned parenthood cecile richards and others. several of biden’s family also attended. these included the president’s daughter, ashley biden and her husband, dr. howard krein, and hunter biden's daughters, finnegan biden and naomi biden neal. several lawmakers and state executives also attended the distinguished dinner, including gov. kathy hochul of gov. josh shapiro of pennsylvania, gov. tony evers of wisconsin, and gov. roy cooper of north carolina. "today, without question, our alliance is literally stronger than it's ever been," biden said at the dinner, referencing the u.s.-japan relationship. "tonight, we pledge to keep going. we stand at an inflection point where the decisions we make now are going to determine the course of the future for decades to come. a future that the kids of our two families and children of our two countries remember. but i also know that japan and the united states stand together and everyone should know that as well, committed to each other and committed to keeping building the future worthy of the highest hopes." the japanese prime minister also shared brief remarks, saying he and his wife were "speechless" by the number of "huge number of prominent american and japanese guests." "mr. president. dr. biden. distinguished guests and ladies and gentlemen, i would like to express my heartfelt gratitude to you for hosting such a wonderful dinner and your warm welcome and hospitality," kishida said. "first and foremost, to be honest, my breath is taken and i'm speechless in front of such a huge number of prominent american and japanese guests. and my wife yuko, also left breathless, just told me that it was hard to tell who the guest of honor is." fox news digital made repeated attempts to reach out to the trump and biden campaigns for a statement but did not immediately receive a response. in contrast, the presumptive republican nominee joined everyday americans at a chick-fil-a restaurant, where he chatted with staff and treated customers inside the store to chicken and milkshakes. "can i have 30 milkshakes and some chicken?" trump can be heard asking the employees. "we’re going to take care of the customers." in various videos of the exchange, trump is seen surrounded and conversing with a group of people. the flattered crew members and asked if they were making "a lot of money." "business is good?" the former president asked, prompting nods from the workers. "making a lot of money? getting rich, right? that’s wonderful." he then took photos with the various customers and asked if everyone was having a good time. "we don’t care what the media says, we support you," one woman can be heard saying. the former president responded kindly, hugging the woman, who added: "tell my mom that i made it." trump also praised the chick-fil-a brand, saying, "they do very well." he also joked that he knew the menu better than the employees. trump then instructed the staff that he was going to hand them out to the customers and take some for his entourage. the videographer then jokingly said, "it’s the lord’s chicken," and trump agreed. "it’s the lord’s chicken, you’re right," he said. "it’s good chicken, too." after his visit to georgia, trump is expected to go to the former president and biden are expected to be certified as their respective party’s official nominees over the summer ahead of their 2020 rematch in november. get the latest updates from the 2024 campaign trail, exclusive interviews and more fox news politics content. subscribed you've successfully subscribed to this newsletter!",
        "scaled_num_entities": 0.141176471,
        "scaled_num_quotes": 0.507692308,
        "scaled_sentiment_polarity": 0.832911541,
        "scaled_sentiment_subjectivity": 0.485973544,
        "scaled_num_speculations": 0.142857143,
        "scaled_article_length": 0.185218078,
        "scaled_avg_sentence_length": 0.027828904,
        "scaled_num_adjectives": 0.301470588,
        "scaled_num_numerical_data": 0.037267081,
        "scaled_readability": 0.609611925,
        "scaled_headline_relevance": 0,
        "scaled_topic_score": 0.195649778,
        "trustworthy_rate": 0
    },
    {
  "https://www.foxnews.com/politics/dem-linked-political-group-blasted-meddling-key-gop-primary-boost-challenger-lame-attempt": {
    "id": 7,
    "title": "Dem-linked political group blasted for meddling in key GOP primary to boost challenger: 'Lame attempt'",
    "platform": "foxnews",
    "aticle_text": "senate candidate and former navy seal tim sheehy says democrats are spending millions in advertisements against him "to distract montana voters from jon tester's record." a california-based group linked to democrats is getting involved in a pennsylvania congressional primary by boosting a republican against a republican incumbent in the latest example of liberal funds being directed toward a gop primary. true patriots pa, a liberal group linked to california democrat rep. eric swalwell, sent out mailers to pennsylvania voters to slam gop rep. brian fitzpatrick and say he is not conservative enough, in essence boosting his primary opponent, mark houck, politico this week. fox news digital obtained some of those mailers that framed fitzpatrick as a "rino" ("republican in name only") and implied he wasn’t conservative enough for the base that supports former president trump. "maga is ready to bag the biggest rino in congress," reads one of the mailers along with a photo of fitzpatrick photoshopped onto a rhinoceros body. "we sent brian fitzpatrick to d.c. to represent our values, instead, he became best friends with kamala harris and the democrats," another mailer said. fec true patriots pa spent roughly $26,000 on the mailer. meagan olson is listed as treasurer for both true patriots pa and the swalwell campaign. "i consider brian a friend and someone who has bravely defied his party to help secure ukraine aid," rep. swalwell told fox news digital in a statement. "i have never heard of his primary opponent and am not involved or support any effort to defeat brian in the primary. my office uses a professional compliance firm that serves as treasurer for dozens of campaigns." when reached for comment, the democratic congressional campaign committee (dccc) directed fox news digital to a in january 2024 in which dccc chair rep. suzan delbene said her group no longer supports the strategy of propping up "far-right" candidates in swing districts. "it should come as no surprise that a group connected to eric swalwell, a california democrat who is so dumb that he was tricked into sleeping with a chinese spy, would be propping up self-described chronic masturbator mark houck in the republican primary against brian fitzpatrick," defending america pac’s chris pack told fox news digital. "even democrats as intellectually challenged as eric swalwell know that their best chance at flipping the one seat needed to take back democrat control of the house of representatives is if mark houck beats brian fitzpatrick in the primary next tuesday." houck, a pro-life activist, has made that he "had a pornography problem" as a young man and at a church conference about talking to his son about masturbation and erections. "i struggled with pornography, and of course that leads to sexual sin, masturbation and stuff. that was a chronic habit," houck said in a 2010 interview, which defending america pac titled "beat it." in a , houck said he "fell victim to the dehumanizing effects of the pornography industry" over "two decades ago." he also defended the conversation about his son, saying the clips "seizes on de-contextualized comments i made with my son present in public pursuit of this transformative ministry" meant to steer people away from pornography. the democrat group boosting houck is the latest example of a recent trend in which liberal funds have been used to back republican challengers in an effort to sink candidates who support or are supported by former president trump. pacs linked to senate majority leader chuck schumer have meddling in gop primaries this cycle, including in swing state senate races in ohio and montana. duty and country pac, affiliated with schumer, during the ohio gop senate primary that accused trump-backed businessman bernie moreno of being "too conservative for ohio." that effort proved unsuccessful in the primary as moreno won every county in the buckeye state, beating his nearest challenger by almost 20 points. in 2022, more than $40 million to boost six pro-trump candidates in republican primaries, and all six of those republicans lost their general election races to democrats. fitzpatrick, who has so far declined to say if he will endorse trump, voted against impeaching trump twice and won re-election in 2022 by almost 10 points, despite biden carrying the 1st congressional district. "after years of brutal losses, the far-left has finally figured out they have no chance of beating congressman fitzpatrick, so they’ve now tagged california left-wing extremists to meddle in his primary using the same violent political rhetoric they claim to stand against," fitzpatrick campaign spokesperson ben trundy told fox news digital in statement. "this lame attempt to prop up mark houck, an admitted porn addict and serial grifter who believes in complete abortion bans with no exceptions, shows just how desperate they are to force their extreme policies on bucks and montgomery county voters." andrew mark miller is a reporter at fox news. find him on twitter @andymarkmiller and email tips to andrewmark.miller@fox.com. get the latest updates from the 2024 campaign trail, exclusive interviews and more fox news politics content. subscribed you've successfully subscribed to this newsletter!",
    "scaled_sentiment_polarity": 0.846836685,
    "scaled_sentiment_subjectivity": 0.488187514,
    "scaled_article_length": 0,
    "scaled_avg_sentence_length": 0.252910993,
    "scaled_num_adjectives": 0.764687477,
    "scaled_num_numerical_data": 0.345588235,
    "scaled_readability": 0.080745342,
    "scaled_headline_relevance": 0.217424827,
    "scaled_topic_score": 0,
    "trustworthy_rate": 0.356589983
  },
  "https://www.bbc.co.uk/news/world-middle-east-68853403": {
    "id": 10,
    "title": "Israel's strike on Iran: Crisis shows how badly Iran and Israel understand each other",
    "platform": "bbc",
    "aticle_text": "they have been urging israel to draw a line under the dangerous series of events that started with israel's assassination of a senior iranian general in damascus on 1 april. more than six months after the hamas attacks on israel, war continues in gaza and has spread to the area either side of the lebanon-israel border and to the gulf. the fear is that the middle east is on the brink of an all-out war, with global as well as regional dangers. the iranians are playing down the significance of what's happened in isfahan. initial reports said there had been no attack. later, an analyst on state tv said air defences had knocked out drones that had been launched by "infiltrators". official media outlets have posted jokey photos of miniature drones. israel was . despite years of enmity and threats it was the first time since the establishment of the islamic republic in 1979 that iran had launched a direct strike from its territory onto israel's. during that attack iran launched more than 300 missiles and drones. almost all of them were destroyed by israel's air defences, augmented by forces from the us, uk and jordan. the iranians had made their intentions clear, giving israel and its allies time to prepare themselves, and quickly issued a statement at the un in new york that their retaliation was over. mr biden urged israel to "take the win" but israel insisted it would hit back. from the outset, this crisis has shown how badly iran and israel understand each other. both miscalculated, deepening the crisis. israel seemed to believe that iran would not respond with anything stronger than outrage when it killed general mohammed reza zahedi in damascus. its air strike in damascus, killing six others, including another general. iran announced it regarded the attack as a strike on its own territory. israel claimed the premises were not protected by diplomatic conventions as the iranian islamic revolutionary guard corps had turned them into a military post. iran, and indeed western allies of israel, did not accept a unilateral reclassification of the building's status - and the government in tehran hoped israel would agree to a draw a line after its response. that was another serious miscalculation. if the attack on isfahan is not followed up with more attacks, then the immediate tensions will ease. what happened overnight could be israeli prime minister benjamin netanyahu's attempt to respond, without alienating mr biden any more than he has already. if this is it, another question is whether it will be enough for the former generals in israel's war cabinet who are believed to want a strong response to, as they see it, restore israel's capacity to deter its enemies. mr netanyahu's ultranationalist coalition allies have also demanded a fierce retaliation from israel. the national security minister itamar ben gvir said that the israelis needed to "go berserk" when iran attacked. in a social media post, he described the isfahan strike as "feeble". the best option for the region, in the opinion of western governments, is for both iran and israel to draw a line under the saga. however, even if this is the end of this stage of this crisis, new precedents have been set. iran has hit israel in a direct attack, and israel has responded with its own direct attack. that is a change in what are often referred to in the region as the "rules of the game" governing the long conflict between iran and israel. the long clandestine war between the two countries has come out of the shadows. in the process iran and israel have shown that for all the obsessive attention they devote to each other, they are not good at reading each other's intentions. in a highly combustible part of the world, that is not encouraging.",
    "scaled_sentiment_polarity": 0.432085316,
    "scaled_sentiment_subjectivity": 0.282156168,
    "scaled_article_length": 0.142857143,
    "scaled_avg_sentence_length": 0.102427472,
    "scaled_num_adjectives": 0.086056769,
    "scaled_num_numerical_data": 0.154411765,
    "scaled_readability": 0.02484472,
    "scaled_headline_relevance": 0.53919301,
    "scaled_topic_score": 1,
    "trustworthy_rate": 0.402351677
  },
  "https://www.foxnews.com/politics/trump-threatened-with-jail-he-misses-hush-money-trial-biden-campaigns-pennsylvania": {
    "id": 11,
    "title": "Trump threatened with jail if he misses hush money trial as Biden campaigns in Pennsylvania",
    "platform": "foxnews",
    "aticle_text": "trump legal spokesperson alina habba joined 'fox & friends first' to discuss the latest on the former president's hush money trial in new york city. president biden returns to the campaign trail on tuesday with a visit to his childhood hometown of scranton to begin three consecutive days of campaigning in pennsylvania. while the democratic incumbent is holding events in the battleground state, his 2024 opponent, is forced to spend the day in a new york city courtroom for the first ever criminal trial of a former president. biden plans to use scranton, a working class city of roughly 75,000 people, as the backdrop to pitch his new tax plan. his travels through pennsylvania overlap with the start of manhattan district attorney alvin bragg’s criminal hush money case against trump. day two of the continues with the jury selection at approximately 9:30 a.m. tuesday. trump has been charged with 34 counts of falsifying business records in the first degree relating to alleged hush money payments to stormy daniels during his successful 2016 presidential campaign. trump has been ordered to attend the court proceedings tuesday and every day of the trial. judge juan merchan told trump that if he fails to be present, a warrant will be issued for his arrest. biden plans to spend tuesday night in scranton before continuing to pittsburgh on wednesday morning. he is expected to then briefly visit the but intends to return to pennsylvania on thursday, with an event in philadelphia. scranton, biden’s first destination, blends the personal and political for biden as he grew up in a three-story colonial home in the green ridge neighborhood. his family later moved to delaware, the state biden ultimately represented in the u.s. senate. "it’s hard to draw paths to biden that don’t involve pennsylvania," said daniel hopkins, a political science professor at the university of pennsylvania. harry truman, in 1948, was the last democrat to become president who did not win the state. his opportunity to campaign comes as trump is sequestered in a courtroom, defending himself against criminal charges. if convicted, trump could be sentenced to time behind bars. trump pleaded not guilty to all counts last year. as monday showed, however, the criminal case against continues to struggle against worries that trump will get a fair trial. yesterday afternoon, 96 prospective jurors were sworn in but more than 50 of them were almost immediately excused for admitting they could not serve as impartial jurors. "it’s a scam. it’s a political witch hunt," trump said after court adjourned monday. judge juan merchan, who trump has repeatedly criticized as being partisan and serving the addressed trump directly before calling the prospective jurors into the courtroom. the judge told trump that if he fails to be present, a warrant will be issued for his arrest. judge merchan also told trump that he has a right to be present at the trial, but that if he disrupts the proceedings he would be removed. trump nodded after hearing the instructions. judge merchan denied trump’s request to be excused from the trial next thursday, after the president expressed he wanted to attend arguments at the supreme court about presidential immunity. the judge has not yet ruled on whether the trial will be adjourned so trump can attend his son barron’s high school graduation. before jury selection began, judge merchan again denied the defense’s request to recuse himself. judge merchan also set a hearing for next tuesday, april 23 to discuss possible sanctions for trump violating the gag order. get the latest updates from the 2024 campaign trail, exclusive interviews and more fox news politics content. subscribed you've successfully subscribed to this newsletter!",
    "scaled_sentiment_polarity": 0.346586457,
    "scaled_sentiment_subjectivity": 0.219788031,
    "scaled_article_length": 0.285714286,
    "scaled_avg_sentence_length": 0.103216894,
    "scaled_num_adjectives": 0.136466539,
    "scaled_num_numerical_data": 0.132352941,
    "scaled_readability": 0.080745342,
    "scaled_headline_relevance": 0.544333076,
    "scaled_topic_score": 0,
    "trustworthy_rate": 0.268953942
  },
}
