{
  "instances": [
    {
      "id": "1",
      "title": "Democrats target statehouses to bolster abortion efforts in 2024",
      "platform": "usatoday",
      "article_text": "Voters in a slew of states could see   explicitly on the ballot this year, in the form of proposed constitutional amendments.   To be effective, though, Democrats say they’ll also need to secure statehouse victories in 2024.  The Democratic Legislative Campaign Committee, an organization focused on electing Democrats at the state level, said in a memo Thursday that these referendums “can be an immediate or initial fix, but the long term building of power in state legislatures is the most effective way” to secure abortion access for Americans across the country. Abortion rights advocates have been on a ballot measure winning streak since 2022, when the Supreme Court overturned Roe v. Wade, a 1973 case guaranteeing the constitutional right to an abortion.  But as some of those successful measures have faced Republican-led challenges after Election Day, and with several states not allowing for citizen-led ballot initiatives, DLCC President Heather Williams told USA TODAY the organization's focus goes beyond ballot measures.  “These initiatives are incredibly important. Enshrining the right to an abortion in a state's constitution is really incredibly important,” she said.  “These measures are an important piece,” Williams added. “But we know that without also building power in the state houses, we're not doing enough. We've got to do it all.”  The DLCC announced a $60 million budget in January to boost candidates and reach out to voters about abortion rights. They have not yet announced any new investments into this focus. But the group and other advocates are sounding the alarm on reproductive rights in 2024 and warning that ballot measures are not an end-all solution.  At least four states will include on November’s ballot a measure to enshrine abortion access in their constitution, and related initiatives continue in about a dozen other states.  But, Williams said, the fight is also in state legislatures.  The DLCC hopes to grow Democrats’ presence and potentially gain new majorities to “maximize the impact of ballot measures” in states where they appear on this year’s ballot, according to Thursday's memo.  In some of those states, including Florida and Missouri, Republicans hold a statehouse supermajority, making the implementation of any ballot measure that passes potentially complicated.  For example, after Ohio voters last November passed an abortion referendum to enshrine abortion access, Republicans in the Buckeye State  to “do everything in (their) power” to block the move.  And advocates are already anticipating a similar response in Florida, where the GOP legislature has a   voter-approved reforms.  As of Wednesday, abortions in Florida are  , with exceptions for rape, incest and human trafficking. November’s ballot measure in the Sunshine State has the potential to reverse this law and extend the limit to viability, around 24 weeks, but Democrats warn the process will likely be drawn out.  “Come November, if, when this amendment passes, that is not going to turn the spigot on or change things overnight,” Florida state Senate Minority Leader Lauren Book told reporters Tuesday.  “It'll probably have to go before the courts and the courts will hopefully rule in that favor, but it's not going to change overnight,” she added. “This is a reality that women and girls will have to live under, for quite some time before a change is made.”  Another reason to pay attention to control of statehouses, Williams said:   do not offer residents the option of a having a citizen-led ballot initiative.  On that list is North Carolina, where abortions are banned after 12 weeks, with exceptions.  “I get asked that question every time there's a successful initiative in another state, if we can do that, and it's just not something that we're able to,” said Tara Romano, executive director of Pro-Choice North Carolina.  But Williams said states like Romano’s will not “get left out” of attempts to increase abortion access.  “It is being done by Democrats in power in the statehouses,” she said, pointing to places like Michigan where a Democratic trifecta   with its Reproductive Health Act earlier this year.  Meanwhile, the DLCC will be watching voter behavior in 2024 as guidance for future elections on expanding Democratic majorities across the map, Williams said.  “Understanding how people show up, how it energizes folks, how abortion plays in these communities will be an important learning lesson.”",
      "scaled_num_entities": "0.6292134831460674",
      "scaled_num_quotes": "0.4642857142857143",
      "scaled_sentiment_polarity": "0.5176096934890906",
      "scaled_sentiment_subjectivity": "1.0",
      "scaled_num_speculations": "0.16666666666666666",
      "scaled_article_length": "0.5933622365076993",
      "scaled_avg_sentence_length": "0.6655516175903258",
      "scaled_num_adjectives": "0.22413793103448276",
      "scaled_num_numerical_data": "0.20512820512820512",
      "scaled_readability": "0.3647890758351621",
      "scaled_headline_relevance": "0.0",
      "topic_score": "0.0"
    }
  ]
}
